SET NAMES UTF8;
DROP DATABASE IF EXISTS qiuxiang;
CREATE DATABASE qiuxiang CHARSET=UTF8;
USE qiuxiang;

/* 用户表 */
CREATE TABLE qiuxiang_user(
  uid INT PRIMARY KEY AUTO_INCREMENT,
  uname VARCHAR(16),	#用户名
  upwd VARCHAR(16),	#密码
  headPortrait VARCHAR(64),	#头像
  follower INT,		#粉丝
  follow INT,		#关注
  bookstack INT,	#书架里书的数量
  readed INT,		#阅读数
  money INT,		#磨铁币
  readTicket INT,	#阅读券
  recommend INT		#推荐票
);
/*书架的书*/
CREATE TABLE qiuxiang_bookstack(
  bsid INT PRIMARY KEY AUTO_INCREMENT,
  user_id INT,	#用户编号
  book VARCHAR(16),	#书名
  sub BOOL	#是否订阅
);


/* 全部书籍 */
CREATE TABLE qiuxiang_book(
  bid INT PRIMARY KEY AUTO_INCREMENT,
  type INT,		#类型  1-都市 2-悬疑   3-玄幻 4-科幻
  book VARCHAR(8),	#书名
  bookpic VARCHAR(64),	#书配套的图片
  author VARCHAR(10),	#作者
  summary VARCHAR(300),	#简介
  end BOOL,		#是否结束
  vip BOOL,		#是否是vip
  sum VARCHAR(16)	#字数
);

/*插入用户资料*/
INSERT INTO qiuxiang_user VALUES
(1,"qiuxiang","123456","headpic/1.jpg",100,50,3,30,120,35,5),
(null,"qiuxiang2","123456","headpic/2.jpg",200,100,7,10,50,60,8),
(null,"qiuxiang3","123456","headpic/3.jpg",123,3,54,33,23,21,3),
(null,"qiuxiang4","123456","headpic/4.jpg",34,35,234,245,55,32,3),
(null,"qiuxiang5","123456","headpic/5.jpg",45,42,22,42,34,1,2),
(null,"qiuxiang6","123456","headpic/6.jpg",21,123,2,23,1,5,6),
(null,"qiuxiang7","123456","headpic/7.jpg",141,45,3,423,45,2,4),
(null,"qiuxiang8","123456","headpic/8.jpg",4,46,34,1,34,18,2);

/*插入书籍*/
INSERT INTO qiuxiang_book VALUES
(1,1,"无敌从来地球开始","book/11.jpg","骑马上虚空","听说，你是无敌寰宇的圣体，扬言要今世无敌。 听说，你是独断万古的大帝，曾开辟无上仙朝。 听说，你是从禁地走出，沉睡万年的魔尊，要血洗三界。 不好意思，有我在，你们都是渣渣。 你们问我是",0,1,"333599"),
(null,1,"非人类聊天群","book/12.jpg","逐星虫","穷途末路的我因为送了一份奇怪的快递，加入了一个诡异无比的聊天群，从此走上了一条不归路。 画皮：欢迎加入聊天群，你的寿命还剩二十三天，很快你就会成为本群的正式成员。 小倩：二十三岁了还没",0,1,"365338"),
(null,1,"都市之梦魇入侵","book/13.jpg","一觉安然","大雾侵蚀，封锁了全球许多地方，很多消息人们只能从电视上知晓。越来越多的人开始失眠，发起噩梦，甚至",0,1,"333359"),
(null,1,"重活不是重生","book/14.jpg","樱桃洼","不是重生，是重活！ 天上掉下个大烧饼，机缘巧合之砸在脑袋上。幸运之人可以改写两个时空的人生道路，",0,1,"464315"),
(null,1,"暗使令","book/15.jpg","明面儿上我是一名普普通通的快递员，开着满载包裹的电瓶车四处奔波，风里来雨里去。 而这私底下，我依旧做着一份快递员的工作，但走的路却非比寻常，","通假字",0,0,"1213154"),
(null,1,"绝世神王在都市","book/16.jpg","在神魔世界四百年，楚尘逆天崛起，历尽沧桑，终于横渡星空回来了。 “人不犯我，我不犯人，人若犯我，斩草除根。”","雪芍",0,1,"112122"),
(null,1,"帝都狂仙","book/17.jpg","秦天在东域只不过是小小结丹修士，逃命回到了地球。 却没想到—— 原本平静的都市里面亦是藏龙卧虎。 但那又怎样？ 他仰天大笑：世上皆凡人，唯我秦狂仙。","大馍馒头",0,0,"12315"),
(null,1,"都市超级修仙人","book/18.jpg","凌晨起床","冷凡是个孤儿，他非常非常的善良，他是金钱为粪土，他见到美女会脸红！！！可是他逃不过被天诅咒的财神命！！！",0,1,"664315"),
(null,2,"阴纹师","book/21.jpg","开在午夜的纹身店，纹的不是龙虎豹，而是……","无二",0,1,"12315"),
(null,2,"十三局密档","book/22.jpg","佛曰：“坐亦禅，行亦禅，一花一世界，一叶一如来。”在这个大千世界中，我们只是一粒粒渺小沙粒而已，在佛的眼里，我们是一个个的微观世界，而在我们的眼里，却又如何去认识我们所处的这个大千世界","熊样",1,1,"85742"),
(null,2,"黄泉密码","book/23.jpg","来自那个世界的密语，破解了密码，就破解了生命之谜。 随着那道神秘大门的开启……故事将会是独一无二的体验！","奔放的程序员",0,1,"11354"),
(null,2,"活人扎纸师","book/24.jpg","贪图一份钱多事少离家近的工作，我去了镇上的纸扎店上班，结果同事接连横死，我也几次在鬼门关前走过，后来更因多管闲事得罪城隍，欠下阴债，为了还债疲于奔命。","泡面公子",0,1,"145535"),
(null,2,"死亡广播","book/25.jpg","因为这件诡异的事，我成为“死亡广播”的成员； 死亡广播，死神一般的主宰； 每个成员，都会经历恐怖、诱惑，以及死亡……","农夫仙拳",0,1,"186643"),
(null,2,"玄事档案","book/26.jpg","蔡凡本想就这么“咸鱼”一辈子，但自遇到尸油美容事件开始，邪尸、鬼猫等怪事一件接着一件，他陷入了一系列诡异的事情当中，从此告别“咸鱼”生活……","人可先生",0,1,"285463"),
(null,2,"我给阎王做直播","book/27.jpg","这个直播，有点搞笑。","小冷",0,1,"28453"),
(null,2,"诡命法医","book/28.jpg","一把千年以前的‘手术刀’，半本祖辈遗留的残卷。 法医，在很久以前，也叫仵作。 我，徐祸。接受了现代法医学科教育，却意外得到一把传承千年的——仵作的刀。 “凡斗殴伤重不能重履之人，不得扛抬","天工匠人",0,1,"384651"),
(null,2,"阴山传人","book/29.jpg","师傅收我为徒，却说只能教我三件事……","喝粥老米",0,1,"14646"),
(null,2,"我在午夜当木偶","book/211.jpg","一场看似简单的婚礼，背后却隐藏着一个又一个秘密； 让我一步步的走进无底深渊。 百年来的隔世纠葛， 满含怨念的诡异鸳鸯， 能操纵过去未来的生死冥书一个个随之浮出水面。 而我却宛如一个提线木偶，","脆响",0,1,"184621"),
(null,2,"禁地密码","book/212.jpg","荒凉偏僻的苗疆废校，大山深处的葬树骨窟，神秘莫测的湘南老镇，阴森诡秘的密函妖湖，传说中连接冥界的葬山，鬼影重重的先苗秘寨……百年前先人留下的传说，背负着百年诅咒的我，该如何一步步踏足那","池墨砚清",1,1,"184121"),
(null,2,"这局阎王不好带","book/213.jpg","我是地府女阎君，刚上任就被罚入轮回，自己在人间悠哉悠哉的恋爱、历劫，还坚信什么一切皆有定数，却不知让跟随我的人操碎了心。 特别是黑无常。","藏密阿弥陀",0,1,"86343"),
(null,2,"诡食秘录","book/214.jpg","美味入口，必定是身心愉悦的。这世上一切的不如意，在美食的催化下，都能被中和得不值一提。人生在世，吃喝二字，千金散尽还复来。 不过，世间万物都讲究个相生相克，凡是都有度，一旦过了量，有","唐苹果",0,1,"84331"),
(null,2,"画灵人","book/215.jpg","掌灵术，执阴阳，画生死。 我叫李念，本是穷家小子，胸无大志，却在十二岁那年，阴差阳错成为画灵传人，行走在生与死的边缘……","悠悠慢",0,0,"91123"),
(null,2,"天才少女相师","book/216.jpg","活了一千多年的玄门大佬“一字断命”李兮若不甘心寿终正寝，逆天借命，夺舍了一个十八岁的小姑娘，不想一睁开眼睛，就有小三带着尼姑上门，说李兮若和她的便宜娘是克夫克父的天煞命格。 李兮若：","慕容夕",0,0,"33311"),
(null,2,"废材天师","book/217.jpg","天惶惶，地惶惶，我家有个夜哭郎。 过路仙人帮个忙，驱污赶邪到此房，一觉睡到大天亮……","南明夫人",0,1,"44431"),
(null,2,"特殊任命","book/218.jpg","一巴掌把酆都大帝打回冥界，一句话断人生死，你是冥界的逃犯？对不起，我是人间的判官，请你回到属于自己的地方去。","老生笑笑",0,1,"133153"),
(null,2,"秋坟听异事","book/219.jpg","相传由古至今有四种奇人异士，精通男扮女装的采花人，留有二尺指甲用来预测天气和疾病的纤手者，用一把菜刀占破天机的神秘赊刀人，以及精于卦象风水的术士。 这四种人行走于中原大地，经历数不尽的","披衣煮冷酒",0,0,"51358"),
(null,2,"女娲密码","book/221.jpg","林峰原本是浪迹在火车站的一个小青年，却因为误抢一南方老板的包裹卷进了一个涉及三代人的惊魂角逐当中。","阿懒小哥",0,1,"643148"),
(null,3,"龙女婿大丈夫","book/31.jpg","作为小说作者，竟然穿越到了自己的小说里面，穿越也就罢了，竟然还是个反派附体？！看有史以来最倒霉的穿越者，还有半年的死期，他是否能够力挽狂澜？","龙不相",0,1,"1132158"),
(null,3,"穿越上古当码农","book/32.jpg","苦逼程序员加班猝死，穿越上古时代，神魂化为强悍电脑。 自此天机我掌，上古功法、惊世丹道、无敌阵法，唾手可得！ 带齐人马，起于微末，步步登临至尊！ 大道神仙九重天，我以我血杀神仙！ 无尽灵海","空城白墨",0,1,"318123"),
(null,3,"超级宗门系统","book/33.jpg","这是一个门派养成的故事，有温馨欢乐，也有铁血无情，一个欢乐宗主带着一群拥有自己喜怒哀乐的弟子们的成长故事。 来吧！朋友，加入北玄派，一起Hi起来！","苏二强",0,1,"131853"),
(null,3,"永恒圣主","book/34.jpg","空间无敌，时间至上。 穿越到灵气复苏的武道世界，立天庭、定天条、铸天梯，镇压一世！ 奈何，天道变异。 如果，能有一次重来的机会，必将劈荆斩棘，破开枷锁，成就永恒。","可笑书仙",1,0,"83616"),
(null,3,"天命道尊","book/35.jpg","欲成仙者得天命，得天命者命苍天。这是一句自古便流传在修炼界的古言。 东荒星第一强者独孤傲天偶得天命珠，却在闭关之时遭自己侍妾联合外敌偷袭至死。 再次醒来，独孤傲天发现自己带着天命","黑袍",0,1,"748163"),
(null,4,"王牌时空战将","book/41.jpg","公元2045年，太阳突然进入炽热期，气温以放射性的速度逐渐增高，太阳磁暴活动日益频繁、剧烈，各种有害射线不断冲击D球，野生物种进入大规模进化灭绝期；部分物种的基因也发生变异,包含很多家畜","沫浴春风",1,1,"746135"),
(null,4,"我的丧尸手册","book/42.jpg","我叫步世仁，今天已经是我变成丧尸的第1042天。 大街之上，如果你看到一个傻呆呆的丧尸，站在路当中一动不动。 那可能，就是我了。 本手册，将指导地表最废丧尸如何在末日中求生。","蛋卷星人",0,1,"746361"),
(null,5,"夺嫡","book/51.jpg","大康王朝，朝堂争斗，风云诡谲，世家门阀，尔虞我诈…… 　 地球二十一世纪好青年陆铮，穿越成为江南陆家庶子，受嫡母排挤，遭家族流放，寄人篱下，受尽欺辱。 逆境中，且看陆铮如何奋发图强，借势","南华",0,0,"15813"),
(null,5,"大唐财神爷","book/52.jpg","程咬金是我爹。 李世民是我丈母爷。 太子是我兄弟。 武媚娘是我情人。 至于我嘛，乃是人见人爱，鬼见鬼欢的程二爷。 人送外号，大唐财神爷。","公子齐迹",0,1,"748166"),
(null,5,"暗夜三国","book/53.jpg","本书是三国类第一书，你只有读过本书，才知道什么叫三国。暗夜说：有一种病，叫爱无能。有一种苦，叫相思成疾。有一种罪，叫欲罢不能。有一种思念，叫穿越。你知道吗？","暗夜之神",0,1,"431825");
















